In [28]:
5>10

False

In [31]:
Pluralcode='IT FIRM'
Pluralcode

'IT FIRM'

In [39]:
Firstname='Prince'
Middlename='Ahamuefule'
Lastname='Ononuju'
Fullname=Firstname+ " " +Middlename+ " " +Lastname
Fullname

'Prince Ahamuefule Ononuju'

STRING SLICING AND INDEXING

INDEXING

In [41]:
Fullname[7]

'A'

SLICING

In [42]:
Fullname[0:3]

'Pri'

In [43]:
Fullname[5:]

'e Ahamuefule Ononuju'

In [44]:
Fullname.upper()

'PRINCE AHAMUEFULE ONONUJU'

In [45]:
Fullname.strip()

'Prince Ahamuefule Ononuju'

FORMATTED STRING

In [54]:
Age=35
message= f'I am {35} Years Old'
message

'I am 35 Years Old'

INTEGERS

In [57]:
score=50
type(score)

int

ARITHMETIC CALCULATIONS WITH INT

In [58]:
500*2

1000

In [59]:
55/2

27.5

In [60]:
55//2

27

LIST

In [7]:
Student_names=['Prince', 'Godwill', 'Soki', 'Hajarat', 'Kate', 'Oye','Sakirat','Better','Emmanuel','Rhoda','Juliet']
Student_names

['Prince',
 'Godwill',
 'Soki',
 'Hajarat',
 'Kate',
 'Oye',
 'Sakirat',
 'Better',
 'Emmanuel',
 'Rhoda',
 'Juliet']

In [8]:
Student_names[4]

'Kate'

CHANGING VALUE IN A LIST

In [12]:
Student_names[-3]='Emmanuella'
Student_names

['Prince',
 'Godwill',
 'Soki',
 'Hajarat',
 'Kate',
 'Oye',
 'Sakirat',
 'Better',
 'Emmanuella',
 'Rhoda',
 'Juliet']

USING LIST INBUUILT SYNTAX

APPEND

In [15]:
Student_names.append(506)
Student_names

['Prince',
 'Godwill',
 'Soki',
 'Hajarat',
 'Kate',
 'Oye',
 'Sakirat',
 'Better',
 'Emmanuella',
 'Rhoda',
 'Juliet',
 506,
 506,
 506]

INSERT

In [16]:
Student_names.insert(1,'Damilola')
Student_names

['Prince',
 'Damilola',
 'Godwill',
 'Soki',
 'Hajarat',
 'Kate',
 'Oye',
 'Sakirat',
 'Better',
 'Emmanuella',
 'Rhoda',
 'Juliet',
 506,
 506,
 506]

In [18]:
Student_names.remove(506)
Student_names

['Prince',
 'Damilola',
 'Godwill',
 'Soki',
 'Hajarat',
 'Kate',
 'Oye',
 'Sakirat',
 'Better',
 'Emmanuella',
 'Rhoda',
 'Juliet',
 506,
 506]

POP REMOVES BY SPECIFYING INDEX NUMBER

In [19]:
Student_names.pop(-2)
Student_names

['Prince',
 'Damilola',
 'Godwill',
 'Soki',
 'Hajarat',
 'Kate',
 'Oye',
 'Sakirat',
 'Better',
 'Emmanuella',
 'Rhoda',
 'Juliet',
 506]

COPY

IT IS ADVISABLE TO MAKE A COPY(CLONE) OF YOUR DATA IN THE EVENT THAT YOU MISTAKENLY DELETE THE ACTUAL DATA. ENSURE TO ALWAYS HAVE A CLONE OF THE EXACT DATA

In [21]:
Student_Name_Two=Student_names.copy()
Student_Name_Two

['Prince',
 'Damilola',
 'Godwill',
 'Soki',
 'Hajarat',
 'Kate',
 'Oye',
 'Sakirat',
 'Better',
 'Emmanuella',
 'Rhoda',
 'Juliet',
 506]

In [22]:
del Student_names

In [23]:
Student_names=Student_Name_Two.copy()
Student_names

['Prince',
 'Damilola',
 'Godwill',
 'Soki',
 'Hajarat',
 'Kate',
 'Oye',
 'Sakirat',
 'Better',
 'Emmanuella',
 'Rhoda',
 'Juliet',
 506]

TUPLE


LIST IS CHANGEABLE WHILE TUPLE IS UNCHANGEABLE
TUPLE CAN ONLY BE CHANGED AFTER WE HAVE CONVERTED TO LIST

In [24]:
My_List=['Mango',68.9,600,True,False]

A TUPLE JUST LIKE A LIST IS A WAY OF SAVING MULTIPLE ITEMS USING ONE VARIABLE. TUPLES ARE WRITTEN WITH ROUND BRACKET. TUPLE CAN CONTAIN DIFFERENT DATA TYPES. TUPLES ARE ORDERED, UNCHANGEABLE AND ALLOWS DUPLICATE. TUPLES CAN ALSO BE INDEXED

In [1]:
Fruits=('Mango','Orange','Banana','Apple','Pineapple','Avocado','Water_melon','Cucumber','Strawberry','Pawpaw')
Fruits

('Mango',
 'Orange',
 'Banana',
 'Apple',
 'Pineapple',
 'Avocado',
 'Water_melon',
 'Cucumber',
 'Strawberry',
 'Pawpaw')

In [30]:
Fruits[4]

'Pineapple'

In [3]:
Fruits[2:8]

('Banana', 'Apple', 'Pineapple', 'Avocado', 'Water_melon', 'Cucumber')

CONVERTING TUPLE TO LIST

In [4]:
Fruits_two=list(Fruits)
type(Fruits_two)

list

In [5]:
Fruits_two.append("Orange")
Fruits_two

['Mango',
 'Orange',
 'Banana',
 'Apple',
 'Pineapple',
 'Avocado',
 'Water_melon',
 'Cucumber',
 'Strawberry',
 'Pawpaw',
 'Orange']

In [9]:
Fruits_Three=tuple(Fruits_two)
type(Fruits_Three)

tuple

SET IS A COLLECTION OF ITEMS WHICH IS UNORDERED, UNCHANGEABLE, UNINDEXED.

A SET ALLOWS DIFFERENT DATA. SETS DO NOT ALLOW DUPLICATE VALUES. SETS ARE WRITTEN WITH CURLY BRACKET.

TRUE AND 1 ARE REGARDED AS SAME IN SET WHILE FALSE AND ZERO ARE REGARDED AS SAME

In [11]:
my_set={456,'Aapple',True,46.9,False,1,'Prince',0}
len(my_set)

6

In [12]:
my_set

{456, 46.9, 'Aapple', False, 'Prince', True}

ADDING TO SET

In [18]:
my_set_1={'Mother','Father','China','son'}
my_set_1.update(my_set)
my_set_1

{456,
 46.9,
 'Aapple',
 'China',
 False,
 'Father',
 'Mother',
 'Prince',
 True,
 'son'}

In [16]:
my_set_2=my_set_1.copy()
my_set_2

{456,
 46.9,
 'Aapple',
 'China',
 False,
 'Father',
 'Mother',
 'Prince',
 True,
 'son'}

In [19]:
my_set_1.clear()
my_set_1

set()

SET JOINS

UNION

THE UNION METHOD RETURNS A NEW SET WITH ALL ITEMS FROM BOTH SET

In [21]:
set1=('Data Science','Software Dev','Data Analysis')
set2=my_set_2.union(set1)
set2

{456,
 46.9,
 'Aapple',
 'China',
 'Data Analysis',
 'Data Science',
 False,
 'Father',
 'Mother',
 'Prince',
 'Software Dev',
 True,
 'son'}

In [22]:
set3={78,89,0,67,'Energy',False,1}
set3

{0, 1, 67, 78, 89, 'Energy'}

DICTIONARIES ARE USED TO STORE DATA VALUES IN KEY AND VALUE PAIRS. DICTIONARIES ARE WRITTEN IN CURLY BRACKET. DICTIONARY ITEMS ARE ORDERED, CHANGEABLE AND DO NOT ALLOW DUPLICATES

In [2]:
student_info={'Name':'Adeyinka','Year':2008,'Height':5.11, 'Weight':750,'Complexion':'Fair','Country':'Nigeria'}
student_info

{'Name': 'Adeyinka',
 'Year': 2008,
 'Height': 5.11,
 'Weight': 750,
 'Complexion': 'Fair',
 'Country': 'Nigeria'}

In [27]:
import pandas as pd
data=pd.DataFrame(student_info,index=[0])
data

       Name  Year  Height  Weight Complexion  Country
0  Adeyinka  2008    5.11     750       Fair  Nigeria

In [6]:
student_info_one={'Name':['Adeyinka','Prince','Peter','Silas'],
'Year':[2008,2009,2010,2011],
'Height':[5.11,6.41,8.45,7.22], 'Weight':[750,400,650,500],
'Complexion':['Fair','Dark','Brown','White'], 
'Country':['Nigeria','Spain','Italy','Ghana']}
student_info_one

{'Name': ['Adeyinka', 'Prince', 'Peter', 'Silas'],
 'Year': [2008, 2009, 2010, 2011],
 'Height': [5.11, 6.41, 8.45, 7.22],
 'Weight': [750, 400, 650, 500],
 'Complexion': ['Fair', 'Dark', 'Brown', 'White'],
 'Country': ['Nigeria', 'Spain', 'Italy', 'Ghana']}

In [9]:
import pandas as pd
data_one=pd.DataFrame(student_info_one)
data_one

       Name  Year  Height  Weight Complexion  Country
0  Adeyinka  2008    5.11     750       Fair  Nigeria
1    Prince  2009    6.41     400       Dark    Spain
2     Peter  2010    8.45     650      Brown    Italy
3     Silas  2011    7.22     500      White    Ghana

TO UPDATE THE DATAFRAME. USE THE METHOD BELOW

In [10]:
data_one['Hobby']=['Reading','Swimming','Sky-Diving','Shopping']
data_one

       Name  Year  Height  Weight Complexion  Country       Hobby
0  Adeyinka  2008    5.11     750       Fair  Nigeria     Reading
1    Prince  2009    6.41     400       Dark    Spain    Swimming
2     Peter  2010    8.45     650      Brown    Italy  Sky-Diving
3     Silas  2011    7.22     500      White    Ghana    Shopping

TO ADD ADDITIONL COLUMN, YOU MUST INITIATE THE APPEND PROCESS BEFORE CONVERTING TO A DATAFRAME.

ADDING AN EXTRA ROW TO A DATAFRAME

In [26]:
data_one.loc[len(data_one)]=['Fatimah',2020,9.55,380,'Yellow','Germany','Singing']
data_one

       Name  Year  Height  Weight Complexion  Country       Hobby
0  Adeyinka  2008    5.11     750       Fair  Nigeria     Reading
1    Prince  2009    6.41     400       Dark    Spain    Swimming
2     Peter  2010    8.45     650      Brown    Italy  Sky-Diving
3     Silas  2011    7.22     500      White    Ghana    Shopping
4   Fatimah  2020    9.55     380     Yellow  Germany     Singing

EDITING

In [27]:
data_one.loc[4,'Country']='Zambia'
data_one

       Name  Year  Height  Weight Complexion  Country       Hobby
0  Adeyinka  2008    5.11     750       Fair  Nigeria     Reading
1    Prince  2009    6.41     400       Dark    Spain    Swimming
2     Peter  2010    8.45     650      Brown    Italy  Sky-Diving
3     Silas  2011    7.22     500      White    Ghana    Shopping
4   Fatimah  2020    9.55     380     Yellow   Zambia     Singing

CHANGING THE ENTIRE VALUE OF A ROW

In [28]:
data_one.loc[4]=['Alhaja',2007,5.7,730,'Fair','Polish','Touring']
data_one

       Name  Year  Height  Weight Complexion  Country       Hobby
0  Adeyinka  2008    5.11     750       Fair  Nigeria     Reading
1    Prince  2009    6.41     400       Dark    Spain    Swimming
2     Peter  2010    8.45     650      Brown    Italy  Sky-Diving
3     Silas  2011    7.22     500      White    Ghana    Shopping
4    Alhaja  2007    5.70     730       Fair   Polish     Touring

RENAMING COLUMN TO A DIFFERENT NAME

AXIS IS 1 BECAUSE IT IS A COLUMN

In [31]:
data_one=data_one.rename({'Year':'Date_of_Birth'}, axis=1)
data_one

       Name  Date_of_Birth  Height  Weight Complexion  Country       Hobby
0  Adeyinka           2008    5.11     750       Fair  Nigeria     Reading
1    Prince           2009    6.41     400       Dark    Spain    Swimming
2     Peter           2010    8.45     650      Brown    Italy  Sky-Diving
3     Silas           2011    7.22     500      White    Ghana    Shopping
4    Alhaja           2007    5.70     730       Fair   Polish     Touring